src/test/resources/com/cardinity/model/invalid_method_payment.json

{
  "id": "90095d47-11bb-468b-8764-fd4fbb49a9f9",
  "amount": "15.00",
  "currency": "EUR",
  "created": "2014-12-19T11:52:53Z",
  "type": "authorization",
  "live": false,
  "status": "approved",
  "order_id": "123456",
  "description": "some description",
  "country": "LT",
  "payment_method": "invalid",
  "payment_instrument": {
  }
}